bmourit/ArduinoCore-MFL/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.usb=USB support (if available)

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

##################################################
# GD32F30x
gd_gd32f30x.name=GD32F303R series
gd_gd32f30x.build.core=Arduino
gd_gd32f30x.build.board=gd32f30x
gd_gd32f30x.build.mcu=cortex-m4
gd_gd32f30x.build.series=GD32F30x

gd_gd32f30x.build.vid=0xdead
gd_gd32f30x.build.pid=0xbeef
gd_gd32f30x.build.usb_product="USB Test"
gd_gd32f30x.build.usb_manufacturer="Arduino"

# create a new entry for each board here

# Creality V4.2.2 GD32F303RE
gd_gd32f30x.menu.pnum.MFL_CREALITY_422=Creality GD32F303RE
gd_gd32f30x.menu.pnum.MFL_CREALITY_422.upload.maximum_size=524288
gd_gd32f30x.menu.pnum.MFL_CREALITY_422.upload.maximum_data_size=65536
gd_gd32f30x.menu.pnum.MFL_CREALITY_422.build.board=MFL_CREALITY_422
gd_gd32f30x.menu.pnum.MFL_CREALITY_422.build.series=GD32F30x
gd_gd32f30x.menu.pnum.MFL_CREALITY_422.build.product_line=GD32F30X_HD
gd_gd32f30x.menu.pnum.MFL_CREALITY_422.build.variant=MFL_CREALITY_422
gd_gd32f30x.menu.pnum.MFL_CREALITY_422.upload.openocd_script=target/gd32f3x.cfg

# Creality V4.2.7 GD32F303RE
gd_gd32f30x.menu.pnum.MFL_CREALITY_427=Creality GD32F303RE
gd_gd32f30x.menu.pnum.MFL_CREALITY_427.upload.maximum_size=524288
gd_gd32f30x.menu.pnum.MFL_CREALITY_427.upload.maximum_data_size=65536
gd_gd32f30x.menu.pnum.MFL_CREALITY_427.build.board=MFL_CREALITY_427
gd_gd32f30x.menu.pnum.MFL_CREALITY_427.build.series=GD32F30x
gd_gd32f30x.menu.pnum.MFL_CREALITY_427.build.product_line=GD32F30X_HD
gd_gd32f30x.menu.pnum.MFL_CREALITY_427.build.variant=MFL_CREALITY_427
gd_gd32f30x.menu.pnum.MFL_CREALITY_427.upload.openocd_script=target/gd32f3x.cfg

# Aquila GD32F303RE
gd_gd32f30x.menu.pnum.MFL_AQUILA=Aquila GD32F303RE
gd_gd32f30x.menu.pnum.MFL_AQUILA.upload.maximum_size=524288
gd_gd32f30x.menu.pnum.MFL_AQUILA.upload.maximum_data_size=65536
gd_gd32f30x.menu.pnum.MFL_AQUILA.build.board=MFL_AQUILA
gd_gd32f30x.menu.pnum.MFL_AQUILA.build.series=GD32F30x
gd_gd32f30x.menu.pnum.MFL_AQUILA.build.product_line=GD32F30X_HD
gd_gd32f30x.menu.pnum.MFL_AQUILA.build.variant=MFL_AQUILA
gd_gd32f30x.menu.pnum.MFL_AQUILA.upload.openocd_script=target/gd32f3x.cfg

# Optimizations
gd_gd32f30x.menu.opt.osstd=Smallest (-Os default)
gd_gd32f30x.menu.opt.o1std=Fast (-O1)
gd_gd32f30x.menu.opt.o1std.build.flags.optimize=-O1
gd_gd32f30x.menu.opt.o1std.build.flags.ldspecs=
gd_gd32f30x.menu.opt.o2std=Faster (-O2)
gd_gd32f30x.menu.opt.o2std.build.flags.optimize=-O2
gd_gd32f30x.menu.opt.o2std.build.flags.ldspecs=
gd_gd32f30x.menu.opt.o3std=Fastest (-O3)
gd_gd32f30x.menu.opt.o3std.build.flags.optimize=-O3
gd_gd32f30x.menu.opt.o3std.build.flags.ldspecs=
gd_gd32f30x.menu.opt.ogstd=Debug (-Og)
gd_gd32f30x.menu.opt.ogstd.build.flags.optimize=-Og
gd_gd32f30x.menu.opt.ogstd.build.flags.ldspecs=
gd_gd32f30x.menu.opt.ogstd=No Optimization (-O0)
gd_gd32f30x.menu.opt.ogstd.build.flags.optimize=-O0
gd_gd32f30x.menu.opt.ogstd.build.flags.ldspecs=

##################################################
# Creality GD32F10x
gd_gd32f10x.name=GD32F103R series
gd_gd32f10x.build.core=Arduino
gd_gd32f10x.build.board=gd32f10x
gd_gd32f10x.build.mcu=cortex-m3
gd_gd32f10x.build.series=GD32F10x

gd_gd32f10x.build.vid=0xdead
gd_gd32f10x.build.pid=0xbeef
gd_gd32f10x.build.usb_product="USB Test"
gd_gd32f10x.build.usb_manufacturer="Arduino"

# create a new entry for each board here

# Creality V4.2.2 Cortex-M3 GD32F103RE
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3=Creality GD32F103RE
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3.upload.maximum_size=524288
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3.upload.maximum_data_size=65536
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3.build.board=MFL_CREALITY_422_M3
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3.build.series=GD32F10x
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3.build.product_line=GD32F10X_HD
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3.build.variant=MFL_CREALITY_V422_M3
gd_gd32f10x.menu.pnum.MFL_CREALITY_422_M3.upload.openocd_script=target/gd32f1x.cfg

# Optimizations
gd_gd32f10x.menu.opt.osstd=Smallest (-Os default)
gd_gd32f10x.menu.opt.o1std=Fast (-O1)
gd_gd32f10x.menu.opt.o1std.build.flags.optimize=-O1
gd_gd32f10x.menu.opt.o1std.build.flags.ldspecs=
gd_gd32f10x.menu.opt.o2std=Faster (-O2)
gd_gd32f10x.menu.opt.o2std.build.flags.optimize=-O2
gd_gd32f10x.menu.opt.o2std.build.flags.ldspecs=
gd_gd32f10x.menu.opt.o3std=Fastest (-O3)
gd_gd32f10x.menu.opt.o3std.build.flags.optimize=-O3
gd_gd32f10x.menu.opt.o3std.build.flags.ldspecs=
gd_gd32f10x.menu.opt.ogstd=Debug (-Og)
gd_gd32f10x.menu.opt.ogstd.build.flags.optimize=-Og
gd_gd32f10x.menu.opt.ogstd.build.flags.ldspecs=
gd_gd32f10x.menu.opt.ogstd=No Optimization (-O0)
gd_gd32f10x.menu.opt.ogstd.build.flags.optimize=-O0
gd_gd32f10x.menu.opt.ogstd.build.flags.ldspecs=
